---
type: BasicFileInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 18
tags: [revit-api, class]
---

# BasicFileInfo

`Autodesk.Revit.DB.BasicFileInfo` · Revit 2024 · 18 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Extract | 2013 | `public static BasicFileInfo Extract ( string file )` |
| Method | GetDocumentVersion | 2015 | `public DocumentVersion GetDocumentVersion ()` |
| Property | AllLocalChangesSavedToCentral | 2013 | `public bool AllLocalChangesSavedToCentral { get ; }` |
| Property | CentralPath | 2013 | `public string CentralPath { get ; }` |
| Property | Format | 2019 | `public string Format { get ; }` |
| Property | IsCentral | 2013 | `public bool IsCentral { get ; }` |
| Property | IsCreatedLocal | 2013 | `public bool IsCreatedLocal { get ; }` |
| Property | IsInProgress | 2013 | `public bool IsInProgress { get ; }` |
| Property | IsLocal | 2013 | `public bool IsLocal { get ; }` |
| Property | IsSavedInCurrentVersion | 2013 | `public bool IsSavedInCurrentVersion { get ; }` |
| Property | IsSavedInLaterVersion | 2017 | `public bool IsSavedInLaterVersion { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | IsWorkshared | 2013 | `public bool IsWorkshared { get ; }` |
| Property | LanguageWhenSaved | 2013 | `public LanguageType LanguageWhenSaved { get ; }` |
| Property | LatestCentralEpisodeGUID | 2013 | `public Guid LatestCentralEpisodeGUID { get ; }` |
| Property | LatestCentralVersion | 2013 | `public int LatestCentralVersion { get ; }` |
| Property | Username | 2013 | `public string Username { get ; }` |